In [1]:
import pandas as pd

### Adding new column to existing DataFrame in Pandas

In [2]:
# Define a dictionary containing Students data
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

In [3]:
df["Address"] = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

In [4]:
df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [5]:
# BY Using insert method()

state = ['Delhi', 'Bangalore', 'Chennai', 'Patna']
df.insert(2, "state", state, True)

In [6]:
df

     Name  Height      state Qualification    Address
0     Jai     5.1      Delhi           Msc      Delhi
1  Princi     6.2  Bangalore            MA  Bangalore
2  Gaurav     5.1    Chennai           Msc    Chennai
3    Anuj     5.2      Patna           Msc      Patna

In [7]:
# Using 'Address' as the column name and equating it to the list
df2 = df.assign(city=['Delhi', 'Bangalore', 'Chennai', 'Patna'])

In [8]:
df2

     Name  Height      state Qualification    Address       city
0     Jai     5.1      Delhi           Msc      Delhi      Delhi
1  Princi     6.2  Bangalore            MA  Bangalore  Bangalore
2  Gaurav     5.1    Chennai           Msc    Chennai    Chennai
3    Anuj     5.2      Patna           Msc      Patna      Patna

In [9]:
df

     Name  Height      state Qualification    Address
0     Jai     5.1      Delhi           Msc      Delhi
1  Princi     6.2  Bangalore            MA  Bangalore
2  Gaurav     5.1    Chennai           Msc    Chennai
3    Anuj     5.2      Patna           Msc      Patna

### Python | Delete rows/columns from DataFrame

In [10]:
df2.drop("city", inplace=True, axis=1)

In [11]:
df2

     Name  Height      state Qualification    Address
0     Jai     5.1      Delhi           Msc      Delhi
1  Princi     6.2  Bangalore            MA  Bangalore
2  Gaurav     5.1    Chennai           Msc    Chennai
3    Anuj     5.2      Patna           Msc      Patna

### Python | Pandas Series.truncate()

In [12]:
df2['Height'].truncate(after=2)

0    5.1
1    6.2
2    5.1
Name: Height, dtype: float64

In [13]:
df2['Height'].truncate(before=2)

2    5.1
3    5.2
Name: Height, dtype: float64

### Iterating over rows and columns in Pandas DataFrame

##### In order to iterate over rows, we can use three function iteritems(), iterrows(), itertuples() . These three function will help in iteration over rows.  

Iteration over rows using iterrows()
In order to iterate over rows, we apply a iterrows() function this function returns each index value along with a series containing the data in each row.

In [14]:
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary
df = pd.DataFrame(dict)
for i, j in df.iterrows():
    print(i, j)

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object
1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object
2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object
3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [15]:
for i, j in df.iteritems():
    print(i, j)

name 0    aparna
1    pankaj
2    sudhir
3     Geeku
Name: name, dtype: object
degree 0       MBA
1       BCA
2    M.Tech
3       MBA
Name: degree, dtype: object
score 0    90
1    40
2    80
3    98
Name: score, dtype: int64

In [16]:
for i in df.itertuples():
    print(i)
    print(i[1])

Pandas(Index=0, name='aparna', degree='MBA', score=90)
aparna
Pandas(Index=1, name='pankaj', degree='BCA', score=40)
pankaj
Pandas(Index=2, name='sudhir', degree='M.Tech', score=80)
sudhir
Pandas(Index=3, name='Geeku', degree='MBA', score=98)
Geeku

In [17]:
for col in df.columns:
    print(col)

name
degree
score

In [22]:
data = pd.read_csv("nba.csv")
 
# sorting data frame by name
data.sort_values("Name", axis = 0, ascending = True,
                 inplace = True, na_position ='last')
 
# display
data

FileNotFoundError: [Errno 2] No such file or directory: 'nba.csv'